backend/tests/jmeter-report-realistic/statistics.json
{
  "Invalid Token - SHOULD FAIL 401" : {
    "transaction" : "Invalid Token - SHOULD FAIL 401",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 0.31999999999999984,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 10.334849111202976,
    "receivedKBytesPerSec" : 10.082533459073998,
    "sentKBytesPerSec" : 1.7460243127325341
  },
  "Invalid Route - SHOULD FAIL 404" : {
    "transaction" : "Invalid Route - SHOULD FAIL 404",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 0.27000000000000013,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 10.332713370531101,
    "receivedKBytesPerSec" : 10.070359320107459,
    "sentKBytesPerSec" : 4.005944539160983
  },
  "No Token Access - SHOULD FAIL 401" : {
    "transaction" : "No Token Access - SHOULD FAIL 401",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 0.29,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 10.32844453625284,
    "receivedKBytesPerSec" : 10.378876394340011,
    "sentKBytesPerSec" : 1.3213146818839083
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 800,
    "errorCount" : 400,
    "errorPct" : 50.0,
    "meanResTime" : 8.198750000000002,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 87.0,
    "pct1ResTime" : 57.0,
    "pct2ResTime" : 58.0,
    "pct3ResTime" : 78.0,
    "throughput" : 81.74943797261395,
    "receivedKBytesPerSec" : 219.71039622930718,
    "sentKBytesPerSec" : 20.626963902513797
  },
  "Health Check - SHOULD PASS" : {
    "transaction" : "Health Check - SHOULD PASS",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.22000000000000006,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 2.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.9899999999999949,
    "throughput" : 10.346611484738748,
    "receivedKBytesPerSec" : 10.6800472064149,
    "sentKBytesPerSec" : 1.2327017589239526
  },
  "Valid Users List - SHOULD PASS" : {
    "transaction" : "Valid Users List - SHOULD PASS",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.89,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 4.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 3.9799999999999898,
    "throughput" : 10.32844453625284,
    "receivedKBytesPerSec" : 32.81096687151415,
    "sentKBytesPerSec" : 3.852993957859946
  },
  "Invalid Login - SHOULD FAIL 401" : {
    "transaction" : "Invalid Login - SHOULD FAIL 401",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 0.9099999999999998,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 2.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 2.0,
    "throughput" : 10.325245224574083,
    "receivedKBytesPerSec" : 10.194163009808982,
    "sentKBytesPerSec" : 2.4098961022199274
  },
  "Valid Billing - SHOULD PASS" : {
    "transaction" : "Valid Billing - SHOULD PASS",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.92,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 11.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.9499999999999886,
    "pct3ResTime" : 10.919999999999959,
    "throughput" : 10.334849111202976,
    "receivedKBytesPerSec" : 121.72595209797437,
    "sentKBytesPerSec" : 3.875568416701116
  },
  "Valid Login - SHOULD PASS" : {
    "transaction" : "Valid Login - SHOULD PASS",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 61.769999999999996,
    "medianResTime" : 58.0,
    "minResTime" : 56.0,
    "maxResTime" : 87.0,
    "pct1ResTime" : 78.0,
    "pct2ResTime" : 80.0,
    "pct3ResTime" : 86.93999999999997,
    "throughput" : 10.221813349688235,
    "receivedKBytesPerSec" : 16.06142351528161,
    "sentKBytesPerSec" : 2.3857552642338753
  }
}